create_clock -period 2.222 -name clk -waveform {0.000 1.111} [get_ports clk]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.300 [get_ports {end_write_HBM[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 0.600 [get_ports {end_write_HBM[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.300 [get_ports {first_message[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 0.600 [get_ports {first_message[*]}]
set _xlnx_shared_i0 [get_ports {read_data_DDR4[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.300 $_xlnx_shared_i0
set_input_delay -clock [get_clocks clk] -max -add_delay 0.600 $_xlnx_shared_i0
set _xlnx_shared_i1 [get_ports {read_data_HBM[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.300 $_xlnx_shared_i1
set_input_delay -clock [get_clocks clk] -max -add_delay 0.600 $_xlnx_shared_i1
set_input_delay -clock [get_clocks clk] -min -add_delay 0.300 [get_ports end_read_DDR4]
set_input_delay -clock [get_clocks clk] -max -add_delay 0.600 [get_ports end_read_DDR4]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.300 [get_ports end_read_HBM]
set_input_delay -clock [get_clocks clk] -max -add_delay 0.600 [get_ports end_read_HBM]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.300 [get_ports first_message_write]
set_input_delay -clock [get_clocks clk] -max -add_delay 0.600 [get_ports first_message_write]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.300 [get_ports read_resp_HBM]
set_input_delay -clock [get_clocks clk] -max -add_delay 0.600 [get_ports read_resp_HBM]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.300 [get_ports reset]
set_input_delay -clock [get_clocks clk] -max -add_delay 0.600 [get_ports reset]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.300 [get_ports resetn]
set_input_delay -clock [get_clocks clk] -max -add_delay 0.600 [get_ports resetn]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.300 [get_ports write_resp_HBM]
set_input_delay -clock [get_clocks clk] -max -add_delay 0.600 [get_ports write_resp_HBM]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {rburst_HBM[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 0.600 [get_ports {rburst_HBM[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {read_addr_DDR4[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 0.600 [get_ports {read_addr_DDR4[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {read_addr_HBM[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 0.600 [get_ports {read_addr_HBM[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {wburst_HBM[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 0.600 [get_ports {wburst_HBM[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {write_addr_HBM[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 0.600 [get_ports {write_addr_HBM[*]}]
set _xlnx_shared_i2 [get_ports {write_data_HBM[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 $_xlnx_shared_i2
set_output_delay -clock [get_clocks clk] -max -add_delay 0.600 $_xlnx_shared_i2
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {wstrobe_HBM[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 0.600 [get_ports {wstrobe_HBM[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports cache_reset_done]
set_output_delay -clock [get_clocks clk] -max -add_delay 0.600 [get_ports cache_reset_done]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports graph_done]
set_output_delay -clock [get_clocks clk] -max -add_delay 0.600 [get_ports graph_done]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports start_read_DDR4]
set_output_delay -clock [get_clocks clk] -max -add_delay 0.600 [get_ports start_read_DDR4]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports start_read_HBM]
set_output_delay -clock [get_clocks clk] -max -add_delay 0.600 [get_ports start_read_HBM]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports start_write_HBM]
set_output_delay -clock [get_clocks clk] -max -add_delay 0.600 [get_ports start_write_HBM]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports write_ready_HBM]
set_output_delay -clock [get_clocks clk] -max -add_delay 0.600 [get_ports write_ready_HBM]
